---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
source: html/8c6d1d90-b89e-8dac-b5c7-67a10aa164e1.htm
---
# ExternalDataInstanceRemovingFromDocumentEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.